tests/fixtures/1-create-2-request-call.xml

<?xml version='1.0' encoding='UTF-8'?>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
    <SOAP-ENV:Header>
        <ecas:ProxyTicket xmlns:ecas="https://ecas.ec.europa.eu/cas/schemas/ws">
            DESKTOP_PT-21-9fp9NEIczaHHpRks3grIc6zde3x4dVLg1FOH8CbffOAbY6l1Tmk1pzdzeqqHxskxmogjhdG6M2FTxl8FzvBrKeR-6VkpUanE2j47ABUTp8nzVb-l8McG2xUUFmyADMKSJyzLimv6n5QtqAzrZGs6Dwx1Ms0
        </ecas:ProxyTicket>
    </SOAP-ENV:Header>
    <S:Body xmlns:ns2="http://eu.europa.ec.dgt.epoetry">
        <ns2:createRequests xmlns:ns2="http://eu.europa.ec.dgt.epoetry">
            <linguisticRequest>
                <generalInfo>
                    <title>Title of the Document call</title>
                    <internalReference>MYREF-DEF-123456</internalReference>
                    <requestedDeadline>2018-11-30T12:00:00.000+01:00</requestedDeadline>
                    <sensitive>false</sensitive>
                    <documentToBeAdopted>false</documentToBeAdopted>
                    <sentViaRUE>false</sentViaRUE>
                    <destinationCode>INTERNE</destinationCode>
                    <slaAnnex>ANNEX8B</slaAnnex>
                    <slaCommitment>XXX-COMM-78910</slaCommitment>
                    <comment>comment</comment>
                    <accessibleTo>DIR</accessibleTo>
                </generalInfo>
                <contacts>
                    <contact roleCode="REQUESTER" userId="paolevi"/>
                    <contact roleCode="AUTHOR" userId="angheda"/>
                </contacts>
                <originalDocument format="TXT" name="test1.txt" trackChanges="false" type="ORI">
                    <file>dGhpcyBpcyBhIHRlc3Q=</file>
                    <linguisticSections>
                        <linguisticSection>
                            <language code="FR"/>
                        </linguisticSection>
                        <linguisticSection>
                            <language code="EN"/>
                        </linguisticSection>
                    </linguisticSections>
                </originalDocument>
                <productRequests>
                    <productRequest trackChanges="false">
                        <language code="BG"/>
                    </productRequest>
                    <productRequest requestedDeadline="2019-04-15T12:00:00.000+02:00" trackChanges="false">
                        <language code="CS"/>
                    </productRequest>
                    <productRequest requestedDeadline="2019-11-15T12:00:00.000+01:00" trackChanges="false">
                        <language code="DE"/>
                    </productRequest>
                    <productRequest requestedDeadline="2019-11-15T12:00:00.000+01:00" trackChanges="false">
                        <language code="EN"/>
                    </productRequest>
                    <productRequest requestedDeadline="2019-11-15T12:00:00.000+01:00" trackChanges="false">
                        <language code="FR"/>
                    </productRequest>
                </productRequests>
                <auxiliaryDocuments>
                    <auxiliaryDocument format="TXT" language="ML" name="test1.txt" type="REF">
                        <file>dGhpcyBpcyBhIHRlc3Q=</file>
                    </auxiliaryDocument>
                    <auxiliaryDocument format="TXT" language="RO" name="test1.txt" type="REF">
                        <file>dGhpcyBpcyBhIHRlc3Q=</file>
                    </auxiliaryDocument>
                </auxiliaryDocuments>
            </linguisticRequest>
            <linguisticRequest>
                <generalInfo>
                    <title>Title of the Document call</title>
                    <internalReference>MYREF-DEF-123456</internalReference>
                    <requestedDeadline>2018-11-30T12:00:00.000+01:00</requestedDeadline>
                    <sensitive>false</sensitive>
                    <documentToBeAdopted>false</documentToBeAdopted>
                    <sentViaRUE>false</sentViaRUE>
                    <destinationCode>INTERNE</destinationCode>
                    <slaAnnex>ANNEX8B</slaAnnex>
                    <slaCommitment>XXX-COMM-78910</slaCommitment>
                    <comment>comment</comment>
                    <accessibleTo>DIR</accessibleTo>
                </generalInfo>
                <contacts>
                    <contact roleCode="REQUESTER" userId="paolevi"/>
                    <contact roleCode="AUTHOR" userId="angheda"/>
                </contacts>
                <originalDocument format="TXT" name="test1.txt" trackChanges="false" type="ORI">
                    <file>dGhpcyBpcyBhIHRlc3Q=</file>
                    <linguisticSections>
                        <linguisticSection>
                            <language code="FR"/>
                        </linguisticSection>
                        <linguisticSection>
                            <language code="EN"/>
                        </linguisticSection>
                    </linguisticSections>
                </originalDocument>
                <productRequests>
                    <productRequest trackChanges="false">
                        <language code="BG"/>
                    </productRequest>
                    <productRequest requestedDeadline="2019-04-15T12:00:00.000+02:00" trackChanges="false">
                        <language code="CS"/>
                    </productRequest>
                    <productRequest requestedDeadline="2019-11-15T12:00:00.000+01:00" trackChanges="false">
                        <language code="DE"/>
                    </productRequest>
                    <productRequest requestedDeadline="2019-11-15T12:00:00.000+01:00" trackChanges="false">
                        <language code="EN"/>
                    </productRequest>
                    <productRequest requestedDeadline="2019-11-15T12:00:00.000+01:00" trackChanges="false">
                        <language code="FR"/>
                    </productRequest>
                </productRequests>
                <auxiliaryDocuments>
                    <auxiliaryDocument format="TXT" language="ML" name="test1.txt" type="REF">
                        <file>dGhpcyBpcyBhIHRlc3Q=</file>
                    </auxiliaryDocument>
                    <auxiliaryDocument format="TXT" language="RO" name="test1.txt" type="REF">
                        <file>dGhpcyBpcyBhIHRlc3Q=</file>
                    </auxiliaryDocument>
                </auxiliaryDocuments>
            </linguisticRequest>
        </ns2:createRequests>
    </S:Body>
</S:Envelope>